excercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Excercises</title>
<!-- 2018-07-15 Sun 17:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Aaron Eline" />
</head>
<body>
<div id="content">
<h1 class="title">Excercises</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Methods</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Quick diagram of what your methods should look like:
</p>

<div class="org-src-container">

<pre class="src src-java">static &lt;type&gt; &lt;name&gt; (&lt;inputs&gt;){

}
</pre>
</div>
<p>
some examples:
</p>
<div class="org-src-container">

<pre class="src src-java">//This is a method that always returns five
static int alwaysFive() {
   return 5;
}
var x = alwaysFive(); // x will be five

//This is a method that takes two arguments and adds them
static int add(int a, int b){
   return a + b;
}
var x = add(1,2); // x will be 3

//Here's the method we wrote that adds up numbers
static int sum(int a){
   var sum = 0;
   while(! (a == 0)){
      sum = sum + a;
      a = a - 1;
   }
   return sum;
}

//This is a method that takes a boolean &amp; an integer. Returns "Yep!" if the boolean is true &amp; the number is more than 5
//Otherwise it returns "Nope!"
static String yepOrNope(boolan b, int x){
   if(b){
     if(x &gt; 5){
	return "Yep!";
     }else{
	return "Nope!";
     }
   }else{
     return "Nope!";
}

var x = yepOrNope(true,6); // x will be "Yep!"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Excercises</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Product</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Write a method called <code>product</code> that computes the result of adding up all numbers from 1 to the input.
</p>

<p>
Examples:
</p>
<ul class="org-ul">
<li><code>product(1)</code> -&gt; 1
</li>
<li><code>roduct(2)</code> -&gt; 2
</li>
<li><code>roduct(3)</code> -&gt; 6
</li>
<li><code>roduct(5)</code> -&gt; 120
</li>
</ul>

<p>
<i>hint:</i> This should be very similar to the <code>add</code> method we wrote.
Think carefully about what value the answer should start at.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Is Even</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Write a function called <code>isEven</code> that determines if an integer is even.
</p>

<p>
Examples:
</p>
<ul class="org-ul">
<li><code>isEven(2)</code> -&gt; <code>true</code>
</li>
<li><code>isEven(3)</code> -&gt; <code>false</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Some type checking</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Look at the <code>yepOrNope</code> method defined above. 
Is writing <code>yepOrNope(true,"hello")</code> valid? Will it run?
</p>

<p>
Is it possible to write a method that sometimes returns an integer, 
and sometimes returns a boolean? If so, write one, if not explain why.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> The idea of "and"</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Like the "not" (<code>!</code>), there are other operations that work on booleans.
One  is and, written <code>&amp;&amp;</code>. And is true if both of the inputs are true.
Examples:
</p>
<ul class="org-ul">
<li><code>true &amp;&amp; true</code> -&gt; <code>true</code>
</li>
<li><code>true &amp;&amp; false</code> -&gt; <code>false</code>
</li>
<li><code>false &amp;&amp; true</code> -&gt; <code>false</code>
</li>
<li><code>false &amp;&amp; false</code> -&gt; <code>false</code>
</li>
<li><code>2 &lt; 5 &amp;&amp; 3 == 3</code> -&gt; <code>true</code>
</li>
<li><code>2 &lt; 5 &amp;&amp; 3 == 4</code> -&gt; <code>false</code>
</li>
<li>~5 &gt; 2 &amp;&amp; "hello"~ -&gt; Does not run becuase "hello" is not a boolean.
</li>
</ul>

<p>
Rewrite the <code>yepOrNope</code> method, but using only one if statement.
</p>
</div>
</div>


<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Counting</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Here's an interesting method
</p>
<div class="org-src-container">

<pre class="src src-java">//Prints out every number from 0 to a
static void count(int a){
   var count = 0;
   while(count &lt; a){
      System.out.println(count);
   }
   return;
}
</pre>
</div>
<p>
<i>Note:</i> This method doesn't return anything. It's type is <code>void</code>. 
It uses print statements inside of itself.
</p>

<p>
Copy the <code>count</code> code to a method called <code>fizzbuzz</code> and modify it do this:
If the number is divisible by 3, print "Fizz" instead of the number
If the number is divisible by 5, print "Buzz" instead of the number
If the number is divisible by 3 &amp; 5, print "FizzBuzz" instead of the number
</p>

<p>
Example Output for <code>fizzbuzz(20)</code>:
1
2
Fizz
4
Buzz
Fizz
7
8
Fizz
Buz
11
Fizz
13
14
FizzBuzz
16
17
Fizz
19
Buzz
</p>

<p>
<b>Challenge Problem:</b> Rewrite the original <code>count</code> method without using <span class="underline">any</span> loops.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aaron Eline</p>
<p class="date">Created: 2018-07-15 Sun 17:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
